In [227]:
import numpy as np
import pandas as pd

In [228]:
obj = pd.Series([4,5,-5,3])
obj

0    4
1    5
2   -5
3    3
dtype: int64

In [229]:
obj.values

array([ 4,  5, -5,  3], dtype=int64)

In [230]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [231]:
obj.dtypes

dtype('int64')

In [232]:
obj2 = pd.Series([3,4,-5,3], index = ['d', 'b', 'a', 'c'])
obj2

d    3
b    4
a   -5
c    3
dtype: int64

In [233]:
sdata = {'Kim' : 35000, 'Beomwoo' : 67000, 'Joan' : 12000, 'Choi' : 4000 }
print(sdata)
obj3 = pd.Series(sdata)
print(obj3)

{'Kim': 35000, 'Beomwoo': 67000, 'Joan': 12000, 'Choi': 4000}
Kim        35000
Beomwoo    67000
Joan       12000
Choi        4000
dtype: int64

In [234]:
obj3.name = 'Salary'
obj3.index.name = 'Names'
obj3

Names
Kim        35000
Beomwoo    67000
Joan       12000
Choi        4000
Name: Salary, dtype: int64

In [235]:
obj3.index = ['A', 'B', 'C', 'D']
obj3

A    35000
B    67000
C    12000
D     4000
Name: Salary, dtype: int64

In [236]:
data = {'name' : ['Beomwoo','Beomwoo','Beomwoo','Kim','Park'],
        'year' : [2013,2014,2015,2016,2015],
        'points' : [1.5, 1.7, 3.6, 2.4, 2.9]}
df = pd.DataFrame(data)
df

      name  year  points
0  Beomwoo  2013     1.5
1  Beomwoo  2014     1.7
2  Beomwoo  2015     3.6
3      Kim  2016     2.4
4     Park  2015     2.9

In [237]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [238]:
df.columns

Index(['name', 'year', 'points'], dtype='object')

In [239]:
df.values

array([['Beomwoo', 2013, 1.5],
       ['Beomwoo', 2014, 1.7],
       ['Beomwoo', 2015, 3.6],
       ['Kim', 2016, 2.4],
       ['Park', 2015, 2.9]], dtype=object)

In [240]:
df.index.name = 'Num'
df.columns.name = 'Info'
df

Info     name  year  points
Num
0     Beomwoo  2013     1.5
1     Beomwoo  2014     1.7
2     Beomwoo  2015     3.6
3         Kim  2016     2.4
4        Park  2015     2.9

In [241]:
df2 = pd.DataFrame(data, columns = ['year', 'name', 'points', 'penalty'],
                    index = ['one', 'two', 'three', 'four', 'five'])
df2

       year     name  points penalty
one    2013  Beomwoo     1.5     NaN
two    2014  Beomwoo     1.7     NaN
three  2015  Beomwoo     3.6     NaN
four   2016      Kim     2.4     NaN
five   2015     Park     2.9     NaN

In [242]:
df2.describe()

              year    points
count     5.000000  5.000000
mean   2014.600000  2.420000
std       1.140175  0.864292
min    2013.000000  1.500000
25%    2014.000000  1.700000
50%    2015.000000  2.400000
75%    2015.000000  2.900000
max    2016.000000  3.600000

In [243]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, one to five
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   year     5 non-null      int64
 1   name     5 non-null      object
 2   points   5 non-null      float64
 3   penalty  0 non-null      object
dtypes: float64(1), int64(1), object(2)
memory usage: 200.0+ bytes

In [244]:
data = {"names" : ["Kilho","Kilho","Kilho","Charles","Charles"],
        "year" : [2014,2015,2016,2015,2016],
        "points" : [1.5, 1.7, 3.6, 2.4, 2.9]}
df = pd.DataFrame(data, columns=["year", "names", "points", "penalty"],
                        index = ["one", "two", "three", "four", "five"])
df

       year    names  points penalty
one    2014    Kilho     1.5     NaN
two    2015    Kilho     1.7     NaN
three  2016    Kilho     3.6     NaN
four   2015  Charles     2.4     NaN
five   2016  Charles     2.9     NaN

In [245]:
df['year']

one      2014
two      2015
three    2016
four     2015
five     2016
Name: year, dtype: int64

In [246]:
df.year

one      2014
two      2015
three    2016
four     2015
five     2016
Name: year, dtype: int64

In [247]:
df[['year','points']]

       year  points
one    2014     1.5
two    2015     1.7
three  2016     3.6
four   2015     2.4
five   2016     2.9

In [248]:
df['penalty'] = 0.5
df

       year    names  points  penalty
one    2014    Kilho     1.5      0.5
two    2015    Kilho     1.7      0.5
three  2016    Kilho     3.6      0.5
four   2015  Charles     2.4      0.5
five   2016  Charles     2.9      0.5

In [249]:
df['penalty'] = [0.1, 0.2, 0.3, 0.4, 0.5]
df

       year    names  points  penalty
one    2014    Kilho     1.5      0.1
two    2015    Kilho     1.7      0.2
three  2016    Kilho     3.6      0.3
four   2015  Charles     2.4      0.4
five   2016  Charles     2.9      0.5

In [250]:
df['zeros'] = np.arange(5)
df

       year    names  points  penalty  zeros
one    2014    Kilho     1.5      0.1      0
two    2015    Kilho     1.7      0.2      1
three  2016    Kilho     3.6      0.3      2
four   2015  Charles     2.4      0.4      3
five   2016  Charles     2.9      0.5      4

In [251]:
val = pd.Series([-1.2, -1.5, -1.7], index= ['two', 'four', 'five'])

In [252]:
df['dept'] = val
df

       year    names  points  penalty  zeros  dept
one    2014    Kilho     1.5      0.1      0   NaN
two    2015    Kilho     1.7      0.2      1  -1.2
three  2016    Kilho     3.6      0.3      2   NaN
four   2015  Charles     2.4      0.4      3  -1.5
five   2016  Charles     2.9      0.5      4  -1.7

In [253]:
df['net_points'] = df['points'] - df['penalty']
df['high_points'] = df['net_points'] > 2.0
df

       year    names  points  penalty  zeros  dept  net_points  high_points
one    2014    Kilho     1.5      0.1      0   NaN         1.4        False
two    2015    Kilho     1.7      0.2      1  -1.2         1.5        False
three  2016    Kilho     3.6      0.3      2   NaN         3.3         True
four   2015  Charles     2.4      0.4      3  -1.5         2.0        False
five   2016  Charles     2.9      0.5      4  -1.7         2.4         True

In [254]:
del df['high_points']
df

       year    names  points  penalty  zeros  dept  net_points
one    2014    Kilho     1.5      0.1      0   NaN         1.4
two    2015    Kilho     1.7      0.2      1  -1.2         1.5
three  2016    Kilho     3.6      0.3      2   NaN         3.3
four   2015  Charles     2.4      0.4      3  -1.5         2.0
five   2016  Charles     2.9      0.5      4  -1.7         2.4

In [255]:
del df['net_points']
df

       year    names  points  penalty  zeros  dept
one    2014    Kilho     1.5      0.1      0   NaN
two    2015    Kilho     1.7      0.2      1  -1.2
three  2016    Kilho     3.6      0.3      2   NaN
four   2015  Charles     2.4      0.4      3  -1.5
five   2016  Charles     2.9      0.5      4  -1.7

In [256]:
del df['zeros']
df

       year    names  points  penalty  dept
one    2014    Kilho     1.5      0.1   NaN
two    2015    Kilho     1.7      0.2  -1.2
three  2016    Kilho     3.6      0.3   NaN
four   2015  Charles     2.4      0.4  -1.5
five   2016  Charles     2.9      0.5  -1.7

In [257]:
df.columns

Index(['year', 'names', 'points', 'penalty', 'dept'], dtype='object')

In [258]:
df.index.name = 'Order'
df.columns.name = 'Info'

In [259]:
df

Info   year    names  points  penalty  dept
Order
one    2014    Kilho     1.5      0.1   NaN
two    2015    Kilho     1.7      0.2  -1.2
three  2016    Kilho     3.6      0.3   NaN
four   2015  Charles     2.4      0.4  -1.5
five   2016  Charles     2.9      0.5  -1.7

In [260]:
df

Info   year    names  points  penalty  dept
Order
one    2014    Kilho     1.5      0.1   NaN
two    2015    Kilho     1.7      0.2  -1.2
three  2016    Kilho     3.6      0.3   NaN
four   2015  Charles     2.4      0.4  -1.5
five   2016  Charles     2.9      0.5  -1.7

In [261]:
df[0:3]

Info   year  names  points  penalty  dept
Order
one    2014  Kilho     1.5      0.1   NaN
two    2015  Kilho     1.7      0.2  -1.2
three  2016  Kilho     3.6      0.3   NaN

In [262]:
df['two' : 'four']

Info   year    names  points  penalty  dept
Order
two    2015    Kilho     1.7      0.2  -1.2
three  2016    Kilho     3.6      0.3   NaN
four   2015  Charles     2.4      0.4  -1.5

In [263]:
df.loc['two']

Info
year        2015
names      Kilho
points       1.7
penalty      0.2
dept        -1.2
Name: two, dtype: object

In [264]:
df.loc['two' : 'four']

Info   year    names  points  penalty  dept
Order
two    2015    Kilho     1.7      0.2  -1.2
three  2016    Kilho     3.6      0.3   NaN
four   2015  Charles     2.4      0.4  -1.5

In [265]:
df.loc['two' : 'four', 'points']

Order
two      1.7
three    3.6
four     2.4
Name: points, dtype: float64

In [266]:
df.loc[:,'year']

Order
one      2014
two      2015
three    2016
four     2015
five     2016
Name: year, dtype: int64

In [267]:
df.loc[:,['year','names']]

Info   year    names
Order
one    2014    Kilho
two    2015    Kilho
three  2016    Kilho
four   2015  Charles
five   2016  Charles

In [268]:
df.loc['three':'five','year' : 'penalty']

Info   year    names  points  penalty
Order
three  2016    Kilho     3.6      0.3
four   2015  Charles     2.4      0.4
five   2016  Charles     2.9      0.5

In [269]:
df.loc['six',:] = [2013,'Jun',4.0,0.1,2.1]
df

Info     year    names  points  penalty  dept
Order
one    2014.0    Kilho     1.5      0.1   NaN
two    2015.0    Kilho     1.7      0.2  -1.2
three  2016.0    Kilho     3.6      0.3   NaN
four   2015.0  Charles     2.4      0.4  -1.5
five   2016.0  Charles     2.9      0.5  -1.7
six    2013.0      Jun     4.0      0.1   2.1

In [270]:
df.iloc[3]

Info
year        2015.0
names      Charles
points         2.4
penalty        0.4
dept          -1.5
Name: four, dtype: object

In [271]:
df.iloc[3:5, 0:2]

Info     year    names
Order
four   2015.0  Charles
five   2016.0  Charles

In [272]:
df.iloc[[0.1,3],[1,2]]

Info     names  points
Order
one      Kilho     1.5
four   Charles     2.4

In [273]:
df.iloc[:,1:4]

Info     names  points  penalty
Order
one      Kilho     1.5      0.1
two      Kilho     1.7      0.2
three    Kilho     3.6      0.3
four   Charles     2.4      0.4
five   Charles     2.9      0.5
six        Jun     4.0      0.1

In [274]:
df.iloc[1,1]

'Kilho'

In [275]:
df

Info     year    names  points  penalty  dept
Order
one    2014.0    Kilho     1.5      0.1   NaN
two    2015.0    Kilho     1.7      0.2  -1.2
three  2016.0    Kilho     3.6      0.3   NaN
four   2015.0  Charles     2.4      0.4  -1.5
five   2016.0  Charles     2.9      0.5  -1.7
six    2013.0      Jun     4.0      0.1   2.1

In [276]:
df['year'] > 2014

Order
one      False
two       True
three     True
four      True
five      True
six      False
Name: year, dtype: bool

In [277]:
df.loc[df['year']>2014,:]

Info     year    names  points  penalty  dept
Order
two    2015.0    Kilho     1.7      0.2  -1.2
three  2016.0    Kilho     3.6      0.3   NaN
four   2015.0  Charles     2.4      0.4  -1.5
five   2016.0  Charles     2.9      0.5  -1.7

In [278]:
df.loc[df['names'] == 'Kilho',['names','points']]

Info   names  points
Order
one    Kilho     1.5
two    Kilho     1.7
three  Kilho     3.6

In [279]:
df.loc[(df['points']>2)&(df['points']<3),:]

Info     year    names  points  penalty  dept
Order
four   2015.0  Charles     2.4      0.4  -1.5
five   2016.0  Charles     2.9      0.5  -1.7

In [280]:
df.loc[df['points']>3, 'penalty'] = 0

In [281]:
df

Info     year    names  points  penalty  dept
Order
one    2014.0    Kilho     1.5      0.1   NaN
two    2015.0    Kilho     1.7      0.2  -1.2
three  2016.0    Kilho     3.6      0.0   NaN
four   2015.0  Charles     2.4      0.4  -1.5
five   2016.0  Charles     2.9      0.5  -1.7
six    2013.0      Jun     4.0      0.0   2.1

In [282]:
df = pd.DataFrame(np.random.randn(6,4))

In [283]:
df

          0         1         2         3
0 -0.727600  1.564592 -0.739633 -0.083856
1  0.700227  0.865760  1.757711 -1.345226
2 -0.250245 -0.727297  1.916411  0.038687
3  0.039913 -1.509060  1.216737  0.560253
4 -0.074943 -0.913099  1.558574 -0.522495
5 -0.185430 -0.537702 -1.079317  2.719396

In [284]:
df.columns = ['A', 'B', 'C', 'D']
df.index = pd.date_range('20160701',periods = 6)
df.index

DatetimeIndex(['2016-07-01', '2016-07-02', '2016-07-03', '2016-07-04',
               '2016-07-05', '2016-07-06'],
              dtype='datetime64[ns]', freq='D')

In [285]:
df

                   A         B         C         D
2016-07-01 -0.727600  1.564592 -0.739633 -0.083856
2016-07-02  0.700227  0.865760  1.757711 -1.345226
2016-07-03 -0.250245 -0.727297  1.916411  0.038687
2016-07-04  0.039913 -1.509060  1.216737  0.560253
2016-07-05 -0.074943 -0.913099  1.558574 -0.522495
2016-07-06 -0.185430 -0.537702 -1.079317  2.719396

In [286]:
df['F'] = [1.0, np.nan, 3.5, 6.1, np.nan, 7.0]
df

                   A         B         C         D    F
2016-07-01 -0.727600  1.564592 -0.739633 -0.083856  1.0
2016-07-02  0.700227  0.865760  1.757711 -1.345226  NaN
2016-07-03 -0.250245 -0.727297  1.916411  0.038687  3.5
2016-07-04  0.039913 -1.509060  1.216737  0.560253  6.1
2016-07-05 -0.074943 -0.913099  1.558574 -0.522495  NaN
2016-07-06 -0.185430 -0.537702 -1.079317  2.719396  7.0

In [287]:
df.dropna(how = 'any')

                   A         B         C         D    F
2016-07-01 -0.727600  1.564592 -0.739633 -0.083856  1.0
2016-07-03 -0.250245 -0.727297  1.916411  0.038687  3.5
2016-07-04  0.039913 -1.509060  1.216737  0.560253  6.1
2016-07-06 -0.185430 -0.537702 -1.079317  2.719396  7.0

In [288]:
df.dropna(how = 'all')

                   A         B         C         D    F
2016-07-01 -0.727600  1.564592 -0.739633 -0.083856  1.0
2016-07-02  0.700227  0.865760  1.757711 -1.345226  NaN
2016-07-03 -0.250245 -0.727297  1.916411  0.038687  3.5
2016-07-04  0.039913 -1.509060  1.216737  0.560253  6.1
2016-07-05 -0.074943 -0.913099  1.558574 -0.522495  NaN
2016-07-06 -0.185430 -0.537702 -1.079317  2.719396  7.0

In [289]:
df

                   A         B         C         D    F
2016-07-01 -0.727600  1.564592 -0.739633 -0.083856  1.0
2016-07-02  0.700227  0.865760  1.757711 -1.345226  NaN
2016-07-03 -0.250245 -0.727297  1.916411  0.038687  3.5
2016-07-04  0.039913 -1.509060  1.216737  0.560253  6.1
2016-07-05 -0.074943 -0.913099  1.558574 -0.522495  NaN
2016-07-06 -0.185430 -0.537702 -1.079317  2.719396  7.0

In [290]:
df.fillna(value = 0.5)

                   A         B         C         D    F
2016-07-01 -0.727600  1.564592 -0.739633 -0.083856  1.0
2016-07-02  0.700227  0.865760  1.757711 -1.345226  0.5
2016-07-03 -0.250245 -0.727297  1.916411  0.038687  3.5
2016-07-04  0.039913 -1.509060  1.216737  0.560253  6.1
2016-07-05 -0.074943 -0.913099  1.558574 -0.522495  0.5
2016-07-06 -0.185430 -0.537702 -1.079317  2.719396  7.0

In [291]:
df.isnull()

                A      B      C      D      F
2016-07-01  False  False  False  False  False
2016-07-02  False  False  False  False   True
2016-07-03  False  False  False  False  False
2016-07-04  False  False  False  False  False
2016-07-05  False  False  False  False   True
2016-07-06  False  False  False  False  False

In [292]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2016-07-01 to 2016-07-06
Freq: D
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       6 non-null      float64
 1   B       6 non-null      float64
 2   C       6 non-null      float64
 3   D       6 non-null      float64
 4   F       4 non-null      float64
dtypes: float64(5)
memory usage: 288.0 bytes

In [293]:
df.loc[df.isnull()['F'], :]

                   A         B         C         D   F
2016-07-02  0.700227  0.865760  1.757711 -1.345226 NaN
2016-07-05 -0.074943 -0.913099  1.558574 -0.522495 NaN

In [294]:
pd.to_datetime('20160701')

Timestamp('2016-07-01 00:00:00')

In [295]:
df.drop(pd.to_datetime('20160701'))

                   A         B         C         D    F
2016-07-02  0.700227  0.865760  1.757711 -1.345226  NaN
2016-07-03 -0.250245 -0.727297  1.916411  0.038687  3.5
2016-07-04  0.039913 -1.509060  1.216737  0.560253  6.1
2016-07-05 -0.074943 -0.913099  1.558574 -0.522495  NaN
2016-07-06 -0.185430 -0.537702 -1.079317  2.719396  7.0

In [296]:
df.drop([pd.to_datetime('20160702'), pd.to_datetime('20160704')])

                   A         B         C         D    F
2016-07-01 -0.727600  1.564592 -0.739633 -0.083856  1.0
2016-07-03 -0.250245 -0.727297  1.916411  0.038687  3.5
2016-07-05 -0.074943 -0.913099  1.558574 -0.522495  NaN
2016-07-06 -0.185430 -0.537702 -1.079317  2.719396  7.0

In [297]:
df.drop('F',axis = 1)

                   A         B         C         D
2016-07-01 -0.727600  1.564592 -0.739633 -0.083856
2016-07-02  0.700227  0.865760  1.757711 -1.345226
2016-07-03 -0.250245 -0.727297  1.916411  0.038687
2016-07-04  0.039913 -1.509060  1.216737  0.560253
2016-07-05 -0.074943 -0.913099  1.558574 -0.522495
2016-07-06 -0.185430 -0.537702 -1.079317  2.719396

In [298]:
df.drop(['B','D'], axis = 1)

                   A         C    F
2016-07-01 -0.727600 -0.739633  1.0
2016-07-02  0.700227  1.757711  NaN
2016-07-03 -0.250245  1.916411  3.5
2016-07-04  0.039913  1.216737  6.1
2016-07-05 -0.074943  1.558574  NaN
2016-07-06 -0.185430 -1.079317  7.0

In [299]:
data = [[1.4, np.nan],
        [7.1, 4.5],
        [np.nan, np.nan],
        [0.75, -1.3]]
print(data)
df = pd.DataFrame(data, columns=["one", "two"], index = ["a","b","c","d"])

[[1.4, nan], [7.1, 4.5], [nan, nan], [0.75, -1.3]]

In [300]:
df

    one  two
a  1.40  NaN
b  7.10  4.5
c   NaN  NaN
d  0.75 -1.3

In [301]:
df.sum(axis = 0)

one    9.25
two    3.20
dtype: float64

In [302]:
df.sum(axis = 1)

a     1.40
b    11.60
c     0.00
d    -0.55
dtype: float64

In [303]:
df.sum(axis = 1, skipna = False)

a      NaN
b    11.60
c      NaN
d    -0.55
dtype: float64

In [304]:
df['one'].sum()

9.25

In [305]:
df.loc['b'].sum()

11.6

In [306]:
df2 = pd.DataFrame(np.random.randn(6,4),
                    columns=["A", "B", "C", "D"],
                    index = pd.date_range("20160701", periods = 6))
df2

                   A         B         C         D
2016-07-01 -0.966432 -0.389559 -0.113434  1.435497
2016-07-02 -0.663980  0.467629 -0.447162  0.986810
2016-07-03  0.842833 -0.100305  2.438416  0.803994
2016-07-04 -0.353952 -0.215555  1.281627  0.194927
2016-07-05 -0.042805  0.179441 -0.556397 -1.140254
2016-07-06  0.261174  1.377562  1.727943  0.833420

In [307]:
df2['A'].corr(df2['B'])

0.2914931564576467

In [308]:
df2['B'].cov(df2['C'])

0.12849885846628242

In [309]:
dates = df2.index
random_dates = np.random.permutation(dates)
df2 = df2.reindex(index = random_dates, columns=["D","B","C","A"])
df2

                   D         B         C         A
2016-07-06  0.833420  1.377562  1.727943  0.261174
2016-07-04  0.194927 -0.215555  1.281627 -0.353952
2016-07-01  1.435497 -0.389559 -0.113434 -0.966432
2016-07-03  0.803994 -0.100305  2.438416  0.842833
2016-07-05 -1.140254  0.179441 -0.556397 -0.042805
2016-07-02  0.986810  0.467629 -0.447162 -0.663980

In [310]:
df2.sort_index(axis = 0)

                   D         B         C         A
2016-07-01  1.435497 -0.389559 -0.113434 -0.966432
2016-07-02  0.986810  0.467629 -0.447162 -0.663980
2016-07-03  0.803994 -0.100305  2.438416  0.842833
2016-07-04  0.194927 -0.215555  1.281627 -0.353952
2016-07-05 -1.140254  0.179441 -0.556397 -0.042805
2016-07-06  0.833420  1.377562  1.727943  0.261174

In [311]:
df2.sort_index(axis = 1)

                   A         B         C         D
2016-07-06  0.261174  1.377562  1.727943  0.833420
2016-07-04 -0.353952 -0.215555  1.281627  0.194927
2016-07-01 -0.966432 -0.389559 -0.113434  1.435497
2016-07-03  0.842833 -0.100305  2.438416  0.803994
2016-07-05 -0.042805  0.179441 -0.556397 -1.140254
2016-07-02 -0.663980  0.467629 -0.447162  0.986810

In [312]:
df2.sort_index(axis = 1, ascending = False)

                   D         C         B         A
2016-07-06  0.833420  1.727943  1.377562  0.261174
2016-07-04  0.194927  1.281627 -0.215555 -0.353952
2016-07-01  1.435497 -0.113434 -0.389559 -0.966432
2016-07-03  0.803994  2.438416 -0.100305  0.842833
2016-07-05 -1.140254 -0.556397  0.179441 -0.042805
2016-07-02  0.986810 -0.447162  0.467629 -0.663980

In [313]:
df2.sort_values(by = 'D')

                   D         B         C         A
2016-07-05 -1.140254  0.179441 -0.556397 -0.042805
2016-07-04  0.194927 -0.215555  1.281627 -0.353952
2016-07-03  0.803994 -0.100305  2.438416  0.842833
2016-07-06  0.833420  1.377562  1.727943  0.261174
2016-07-02  0.986810  0.467629 -0.447162 -0.663980
2016-07-01  1.435497 -0.389559 -0.113434 -0.966432

In [314]:
df2.sort_values(by = 'B', ascending=False)

                   D         B         C         A
2016-07-06  0.833420  1.377562  1.727943  0.261174
2016-07-02  0.986810  0.467629 -0.447162 -0.663980
2016-07-05 -1.140254  0.179441 -0.556397 -0.042805
2016-07-03  0.803994 -0.100305  2.438416  0.842833
2016-07-04  0.194927 -0.215555  1.281627 -0.353952
2016-07-01  1.435497 -0.389559 -0.113434 -0.966432

In [315]:
df2['E'] = np.random.randint(0 , 6, size = 6)
df2["F"] = ["alpha", "beta", "gamma", "gamma", "alpha", "gamma"]
df2

                   D         B         C         A  E      F
2016-07-06  0.833420  1.377562  1.727943  0.261174  5  alpha
2016-07-04  0.194927 -0.215555  1.281627 -0.353952  5   beta
2016-07-01  1.435497 -0.389559 -0.113434 -0.966432  1  gamma
2016-07-03  0.803994 -0.100305  2.438416  0.842833  2  gamma
2016-07-05 -1.140254  0.179441 -0.556397 -0.042805  4  alpha
2016-07-02  0.986810  0.467629 -0.447162 -0.663980  5  gamma

In [316]:
df2.sort_values(by = ['E', 'F'])

                   D         B         C         A  E      F
2016-07-01  1.435497 -0.389559 -0.113434 -0.966432  1  gamma
2016-07-03  0.803994 -0.100305  2.438416  0.842833  2  gamma
2016-07-05 -1.140254  0.179441 -0.556397 -0.042805  4  alpha
2016-07-06  0.833420  1.377562  1.727943  0.261174  5  alpha
2016-07-04  0.194927 -0.215555  1.281627 -0.353952  5   beta
2016-07-02  0.986810  0.467629 -0.447162 -0.663980  5  gamma

In [317]:
df2['F'].unique()

array(['alpha', 'beta', 'gamma'], dtype=object)

In [318]:
df2['F'].value_counts()

gamma    3
alpha    2
beta     1
Name: F, dtype: int64

In [319]:
df2['F'].isin(['alpha','beta'])

2016-07-06     True
2016-07-04     True
2016-07-01    False
2016-07-03    False
2016-07-05     True
2016-07-02    False
Name: F, dtype: bool

In [320]:
df2.loc[df2['F'].isin(['alpha','beta']), :]

                   D         B         C         A  E      F
2016-07-06  0.833420  1.377562  1.727943  0.261174  5  alpha
2016-07-04  0.194927 -0.215555  1.281627 -0.353952  5   beta
2016-07-05 -1.140254  0.179441 -0.556397 -0.042805  4  alpha

In [321]:
df3 = pd.DataFrame(np.random.randn(4,3), columns=['b','d','e'],
                    index = ['Seoul', 'incheon', 'Busan', 'Daegu'])
df3

                b         d         e
Seoul   -1.290274 -2.016261  0.089126
incheon  0.919585  1.505009  0.887151
Busan   -0.842494  0.935642 -0.650042
Daegu   -1.431320  0.708553 -0.568144

In [323]:
func = lambda x : x.max() - x.min()

In [324]:
df3.apply(func, axis = 0)

b    2.350904
d    3.521270
e    1.537192
dtype: float64

In [327]:
df3.to_csv('./data.csv')

In [328]:
df = pd.read_csv('./data.csv')
df

  Unnamed: 0         b         d         e
0      Seoul -1.290274 -2.016261  0.089126
1    incheon  0.919585  1.505009  0.887151
2      Busan -0.842494  0.935642 -0.650042
3      Daegu -1.431320  0.708553 -0.568144